In [1]:
# Handling Missing data

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'A': [1,2,np.nan],
                   'B': [5,np.nan,np.nan],
                   'C': [1,2,3]})

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df.dropna()   # will drop all rows containing at least one Nan

     A    B  C
0  1.0  5.0  1

In [6]:
df.dropna(axis=1)  # Drop all columns containing at least one Nan

   C
0  1
1  2
2  3

In [7]:
df.dropna(thresh=2) # drop only rows having less than 2 NON NANs

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [8]:
df.dropna(thresh=1) # showing only rows having at least 1 non Nan value

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [9]:
df.fillna(value=1000) # fill NaNs with specific value to all rows wherever Nan is present
# we have already seen replace command similar to above fillna

        A       B  C
0     1.0     5.0  1
1     2.0  1000.0  2
2  1000.0  1000.0  3

In [10]:
# replace mean to column A
df['A'].fillna(value=df['A'].mean(), inplace=True)

In [11]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [12]:
df['B'].fillna(value=df['B'].mean(), inplace=True)

In [13]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

---

In [24]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
        'Sales':[200,120,340,124,243,350]}

In [25]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [26]:
type(data)

dict

In [27]:
df = pd.DataFrame(data)

In [28]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

**Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [30]:
df.groupby('Company')

In [31]:
type(df.groupby('Company'))

pandas.core.groupby.generic.DataFrameGroupBy

In [32]:
by_comp = df.groupby("Company")

In [33]:
type(by_comp)

pandas.core.groupby.generic.DataFrameGroupBy

In [36]:
by_comp['Sales'].mean()

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [46]:
# OR you can achieve the same output using one line command

df.groupby('Company').Sales.mean()

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [49]:
by_comp['Sales'].std()

Company
FB       75.660426
GOOG     56.568542
MSFT    152.735065
Name: Sales, dtype: float64

In [50]:
by_comp['Sales'].min()

Company
FB      243
GOOG    120
MSFT    124
Name: Sales, dtype: int64

In [51]:
by_comp['Sales'].max()

Company
FB      350
GOOG    200
MSFT    340
Name: Sales, dtype: int64

In [52]:
by_comp['Sales'].count()

Company
FB      2
GOOG    2
MSFT    2
Name: Sales, dtype: int64

In [55]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [58]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [59]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [81]:
# Create dataframe
data = {'Company':['GOOGLE','GOOGLE','GOOGLE','MICROSOFT','MICROSOFT','FACEBOOK','FACEBOOK','FACEBOOK'],
        'Month':['Jan','Feb','Jan','Jan','Feb','Jan','Feb','Feb'],
        'Region':['East','East','West', 'East','West','East','West','West'],
        'Sales':[200,120,200,340,124,243,350,100]}
df1 = pd.DataFrame(data)

In [82]:
df1

     Company Month Region  Sales
0     GOOGLE   Jan   East    200
1     GOOGLE   Feb   East    120
2     GOOGLE   Jan   West    200
3  MICROSOFT   Jan   East    340
4  MICROSOFT   Feb   West    124
5   FACEBOOK   Jan   East    243
6   FACEBOOK   Feb   West    350
7   FACEBOOK   Feb   West    100

In [83]:
by_compmonth = df1.groupby(['Company','Month'])

In [84]:
by_compmonth

In [85]:
by_compmonth['Sales'].sum()

Company    Month
FACEBOOK   Feb      450
           Jan      243
GOOGLE     Feb      120
           Jan      400
MICROSOFT  Feb      124
           Jan      340
Name: Sales, dtype: int64

# DataFrames - Merging, Joining, and Concatenating

There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating. In this lecture we will discuss these 3 methods with examples.

____

In [87]:
df1 = pd.DataFrame({    'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [88]:
df2 = pd.DataFrame({    'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [89]:
df3 = pd.DataFrame({    'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [91]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [92]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [93]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenation

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use **pd.concat** and pass in a list of DataFrames to concatenate together:

In [95]:
df4 = pd.concat([df1,df2,df3])      # axis is by default 0 ie row - this is row-wise concatanation

In [96]:
df4

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [98]:
df5 = pd.concat([df1,df2,df3],axis=1)    # Concatanating columnwise

In [99]:
df5

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [100]:
df5['A']

      A    A    A
0    A0  NaN  NaN
1    A1  NaN  NaN
2    A2  NaN  NaN
3    A3  NaN  NaN
4   NaN   A4  NaN
5   NaN   A5  NaN
6   NaN   A6  NaN
7   NaN   A7  NaN
8   NaN  NaN   A8
9   NaN  NaN   A9
10  NaN  NaN  A10
11  NaN  NaN  A11

## Merging

The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together.

In [115]:
left = pd.DataFrame({     'key': ['K0', 'K1', 'K2', 'K3','K5','K6'],
                          'A':   ['A0', 'A1', 'A2', 'A3','A4','A5'],
                          'B':   ['B0', 'B1', 'B2', 'B3','B4','B5']})
   
right = pd.DataFrame({    'key': ['K0', 'K1', 'K2', 'K3','K4'],
                          'C':   ['C0', 'C1', 'C2', 'C3','C4'],
                          'D':   ['D0', 'D1', 'D2', 'D3','D4']})

In [116]:
print(left)

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
4  K5  A4  B4
5  K6  A5  B5

In [117]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
4  K5  A4  B4
5  K6  A5  B5

In [118]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3
4  K4  C4  D4

In [119]:
pd.merge(left,right,how='inner',on='key')    # inner join is equijoin, here key is named 'key', first dataframes key is matched with key of second dataframe and wherever (row) it is matching, the complete row from both dataframes is shown

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [120]:
pd.merge(left,right,how='right',on='key') # all rows from right dataframe is picked up

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K2   A2   B2  C2  D2
3  K3   A3   B3  C3  D3
4  K4  NaN  NaN  C4  D4

In [121]:
pd.merge(left,right,how='left',on='key') # all rows from left dataframe is picked up

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3
4  K5  A4  B4  NaN  NaN
5  K6  A5  B5  NaN  NaN

In [123]:
pd.merge(left,right,how='outer',on='key') # All rows from both dataframes

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1   C1   D1
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K5   A4   B4  NaN  NaN
5  K6   A5   B5  NaN  NaN
6  K4  NaN  NaN   C4   D4

# Little complicated example

In [124]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [125]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [126]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [128]:
pd.merge(left, right, on=['key1', 'key2'])   # this is inner join where key1 and key values are matched
# K1, K0 is listed once in left frame whereas there are 2 records matching in right frame so there will be 2 records in the output for K1, K0 keys

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [129]:
# outer join
pd.merge(left, right, how='outer', on=['key1', 'key2'])   # Amtching records from both dataframes + all unique records from each data frame is shown

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [130]:
pd.merge(left, right, how='right', on=['key1', 'key2'])  # right join

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [131]:
pd.merge(left, right, how='left', on=['key1', 'key2'])  # left join

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

# Joining


Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

---

In [133]:
left = pd.DataFrame({'A':   ['A0', 'A1', 'A2'],
                     'B':   ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C':   ['C0', 'C2', 'C3'],
                      'D':   ['D0', 'D2', 'D3']},
                      index =['K0', 'K2', 'K3'])

In [134]:
left.join(right)   # by default left join

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [135]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [136]:
left.join(right, how='left')

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [137]:
left.join(right, how='right')

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

In [3]:
# Sorting 
import pandas as pd
import numpy as np

In [17]:
left = pd.DataFrame({'A':   ['A0', 'A1', 'A2'],
                     'B':   ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2'])

In [18]:
left.columns

Index([u'A', u'B'], dtype='object')

In [19]:
left.sort_index(ascending=False)

     A   B
K2  A2  B2
K1  A1  B1
K0  A0  B0

In [20]:
left.index

Index([u'K0', u'K1', u'K2'], dtype='object')

In [21]:
left.reset_index(inplace=True, drop=True)  # drops the index column which will be created after reseting the index

In [22]:
left

    A   B
0  A0  B0
1  A1  B1
2  A2  B2

In [24]:
left.set_index('A', inplace=True)

In [25]:
left

     B
A
A0  B0
A1  B1
A2  B2

In [26]:
left.sort_index(ascending=False)

     B
A
A2  B2
A1  B1
A0  B0